iPig/src/InformationRegisters/Медицина/Медицина.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Медицина</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Отметка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>НомерЖивотного</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВвода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Медикаменты</name>
    <type>
      <types>CatalogRef.Медикаменты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Диагноз</name>
    <type>
      <types>CatalogRef.Диагноз</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЖурналЛечения</name>
    <type>
      <types>CatalogRef.ЖурналЛечения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

iPig/src/InformationRegisters/Медицина/Forms/ФормаЗаписи/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ДатаВвода") И Параметры.Свойство("НомерЖивотного") Тогда
		Запись.ДатаВвода 		= Параметры.ДатаВвода; 
		Запись.НомерЖивотного 	= Параметры.НомерЖивотного;
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ЖурналЛеченияПриИзмененииНаСервере()
	Запись.Медикаменты 	= Запись.ЖурналЛечения.Медикаменты;
	Запись.Диагноз		= Запись.ЖурналЛечения.Диагноз;
КонецПроцедуры

&НаКлиенте
Процедура ЖурналЛеченияПриИзменении(Элемент)
	ЖурналЛеченияПриИзмененииНаСервере();
КонецПроцедуры
